{
    "profile": {
        "name": "Saood Ghare",
        "role": "Full Stack Web Developer",
        "intro": [
            "Full Stack Developer with a Mechanical Engineering background, leveraging analytical problem-solving skills to build scalable web applications. Specialized in Next.js, React, and Laravel, with a focus on high-performance e-commerce solutions and complex API integrations.",
            "Currently working as a Full Stack Developer at Ahmed Al Maghribi Perfumes in Ajman, UAE, where I orchestrate cloud deployments, integrate payment gateways like Tabby/Tamara, and architect cross-device cart systems.",
            "Previously at AutomateBuddy Technologies, I specialized in building enterprise-grade interfaces with React.js and Redux Toolkit, and developed secure backend systems using .NET Core and PostgreSQL.",
            "I enjoy translating business requirements into optimized, user-centric code. Whether architecting a 'K-Series' launch page with GSAP animations or optimizing server performance for 99.9% uptime, I am driven by impact and efficiency."
        ],
        "skills": [
            "JavaScript (ES6+)",
            "React.js & Next.js",
            "Node.js & Laravel",
            "Spring Boot & .NET Core",
            "SQL (MySQL, PostgreSQL)",
            "Tailwind CSS & GSAP",
            "Redux Toolkit",
            "Git & DevOps",
            "Java & C#",
            "Power BI"
        ],
        "contactMessage": "I'm always open to discussing new projects, creative ideas, or opportunities to be part of your visions. Connect with me on my social platforms or drop me an email."
    },
    "socials": [
        {
            "platform": "LinkedIn",
            "url": "https://www.linkedin.com/in/saood-ghare",
            "color": "#0077b5"
        },
        {
            "platform": "GitHub",
            "url": "https://github.com/saoodghare08",
            "color": "#333"
        },
        {
            "platform": "Instagram",
            "url": "https://www.instagram.com/saood.ghare/",
            "color": "#E1306C"
        },
        {
            "platform": "Email",
            "url": "mailto:saoodaslam4@gmail.com",
            "color": "#D44638"
        }
    ],
    "projects": [
        {
            "title": "Ahmed Al Maghribi",
            "link": "https://ae.ahmedalmaghribi.com/en",
            "description": "Architected a multi-region headless e-commerce platform managing 6 country codebases. Engineered a persistent cross-device cart system, integrated fintech APIs (Tabby/Tamara), and built high-performance landing pages using Next.js 14 and GSAP animations.",
            "imageKey": "Awfa"
        },
        {
            "title": "The Diet Cascade",
            "link": "https://thedietcascade.com/",
            "description": "Delivered a high-performance custom web solution for the healthcare sector. Achieved 100% Google Lighthouse scores for Performance and SEO by optimizing asset loading and server response times on Hostinger.",
            "imageKey": "TDC"
        },
        {
            "title": "Procon Media",
            "link": "https://proconmedia.in/",
            "description": "Developed a fully responsive digital agency interface using Tailwind CSS. Optimized the deployment pipeline via cPanel to ensure SSL compliance, fast rendering, and maximum search engine visibility for lead generation.",
            "imageKey": "Procon"
        }
    ]
}